getoff_app/app/controllers/getoff_infos_controller.rb

  def index
    @getoff_infos = GetoffInfo.all
---
SELECT "getoff_infos".* FROM "getoff_infos"

  def show
    @getoff_infos = GetoffInfo.all
---
SELECT "getoff_infos".* FROM "getoff_infos"

  def create
    respond_to do |format|
    @getoff_info = GetoffInfo.new()
    @getoff_info.station_name = params["station_name"]
    @getoff_info.line_num = params["line_num"]
    @getoff_info.container_num = params["container_num"]
    @getoff_info.hint = params["hint"]

  if @getoff_info.save
---
INSERT INTO "getoff_infos" ("created_at", "hint", "number", "station_name", "time", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Tue, 28 May 2013 11:44:15 UTC +00:00], ["hint", "ㅇㅇㄹㄴ"], ["number", 42], ["station_name", 0], ["time", "2013-05-28T11:43:23Z"], ["updated_at", Tue, 28 May 2013 11:44:15 UTC +00:00]]

  def search
    station_name = params[:station_name]
    if station_name != nil
      @seats = GetoffInfo.find_all_by_station_name(station_name, :order => "time")
    else
      @seats = nil
    end

    respond_to do |format|
      if params[:callback]
        format.js {
          render :json =>
            {:seatlist =>  @seats.map do |x|
---
SELECT "getoff_infos".* FROM "getoff_infos" WHERE "getoff_infos"."station_name" = '' ORDER BY time
SELECT "getoff_infos".* FROM "getoff_infos" WHERE "getoff_infos"."station_id" IS NULL
SELECT "stations".* FROM "stations" WHERE "stations"."name" = '하왕십리' LIMIT 1