getoff_app/app/controllers/stations_controller.rb

  def index
    @stations = Station.all
---
SELECT "stations".* FROM "stations"

  def show
    @station = Station.find(params[:id])
---
SELECT "stations".* FROM "stations" WHERE "stations"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @station = Station.new(params[:station])

    respond_to do |format|
      if @station.save
---
INSERT INTO "stations" ("created_at", "line", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 23 May 2013 07:25:41 UTC +00:00], ["line", "2"], ["name", "하왕십리"], ["updated_at", Thu, 23 May 2013 07:25:41 UTC +00:00]]

  def destroy
    @station = Station.find(params[:id])
    @station.destroy
---
SELECT "stations".* FROM "stations" WHERE "stations"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "stations" WHERE "stations"."id" = ?  [["id", 1]]